examples/DRLinFluids_DFDRL_cylinder/env01/0/U_0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.750";
    object      U_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16200
(
(0.787978 0.680665 7.50493e-22)
(0.535626 0.393319 1.6079e-20)
(0.724141 0.614158 0)
(0.712586 0.331626 -1.81254e-20)
(0.930027 0.777006 -8.78336e-21)
(0.913758 0.794274 0)
(1.1156 0.840212 -5.51316e-20)
(1.15791 0.574344 0)
...
)
;

boundaryField
{
    INLET
    {
        type            inletParabolicVelocity;
        maxValue        1.5;
        n               (1 0 0);
        y               (0 1 0);
        value           nonuniform List<vector> 
21
(
(0.833333 0 0)
(0.629252 0 0)
(0.139456 0 0)
(0.833334 0 0)
(1.37755 0 0)
(1.48639 0 0)
(0.397959 0 0)
(0.139456 0 0)
(0.39796 0 0)
(0.629252 0 0)
(1.0102 0 0)
(1.15986 0 0)
(1.0102 0 0)
(1.28231 0 0)
(1.15986 0 0)
(1.44558 0 0)
(1.48639 0 0)
(1.5 0 0)
(1.37755 0 0)
(1.44558 0 0)
(1.28231 0 0)
)
;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    TOP
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    BOTTOM
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    CYLINDER
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET1
    {
        type            incrementallinearJetParabolicVelocity;
        omega           0.174533;
        r               0.05;
        theta0          1.5708;
        q0              0;
        q1              0;
        alpha           0.1;
        t0              0;
        deltaT          0.0005;
        value           uniform (-0 0 -0);
    }
    JET2
    {
        type            incrementallinearJetParabolicVelocity;
        omega           0.174533;
        r               0.05;
        theta0          1.5708;
        q0              0;
        q1              0;
        alpha           0.1;
        t0              0;
        deltaT          0.0005;
        value           uniform (0 -0 -0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
