examples/DRLinFluids_DFDRL_cylinder/env01/0/Co
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.750";
    object      Co;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16200
(
0.0162234
0.00828421
0.0101598
0.008972
0.0165262
0.0128563
0.019236
0.0158072
...
)
;

boundaryField
{
    INLET
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    TOP
    {
        type            zeroGradient;
    }
    BOTTOM
    {
        type            zeroGradient;
    }
    CYLINDER
    {
        type            zeroGradient;
    }
    JET1
    {
        type            zeroGradient;
    }
    JET2
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
