examples/DRLinFluids_DFDRL_cylinder/env01/0/ddtCorrDdt0(phi)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0.750";
    object      ddtCorrDdt0(phi);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
23855
(
0.00126215
0.00479291
-0.00605506
-0.00815092
0.00971879
-0.00156787
-0.00855222
0.000758808
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
21
(
-5.71176e-265
1.06926e-264
-1.74708e-265
9.8999e-265
-8.25852e-264
-3.58567e-264
-4.27637e-265
1.04541e-264
6.63473e-265
6.48478e-265
-1.23188e-264
9.43012e-264
-1.13443e-264
1.10597e-263
8.37622e-264
5.29592e-264
-3.50195e-264
-6.46274e-264
-1.10232e-263
5.1281e-264
9.77455e-264
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
21
(
-0.00223903
-0.00745085
5.24498e-05
0.00718476
0.00617226
-0.00508661
-0.00131819
0.00233043
-0.00451109
-0.0061898
0.00764492
0.00235755
0.0041188
0.0048948
0.00614333
-0.00706509
0.00822702
-0.00629825
-0.00231784
-0.00738639
0.000737114
)
;
    }
    TOP
    {
        type            calculated;
        value           uniform 0;
    }
    BOTTOM
    {
        type            calculated;
        value           uniform 0;
    }
    CYLINDER
    {
        type            calculated;
        value           uniform 0;
    }
    JET1
    {
        type            calculated;
        value           uniform 0;
    }
    JET2
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
